Revit.Elements.ImportInstance
A Revit ImportInstance Element

Revit.Elements.ImportInstance.#ctor(System.String,Autodesk.Revit.DB.XYZ)
Constructor for ImportInstance
satPath:
translation:

Revit.Elements.ImportInstance.InitImportInstance(System.String,Autodesk.Revit.DB.XYZ)
Initialize an ImportInstance element
satPath:
translation:

Revit.Elements.ImportInstance.BySATFile(System.String)
Import Geometry from a SAT file.  The SAT file is assumed to be in Feet.
pathToFile: The path to the SAT file
Returns:

Revit.Elements.ImportInstance.ByGeometries(Autodesk.DesignScript.Geometry.Geometry[])
Import a collection of Geometry (Solid, Curve, Surface, etc) into Revit as an ImportInstance.  This variant is much faster than
ImportInstance.ByGeometry as it uses a batch method.
geometries: A collection of Geometry
Returns:

Revit.Elements.ImportInstance.ByGeometry(Autodesk.DesignScript.Geometry.Geometry)
Import a collection of Geometry (Solid, Curve, Surface, etc) into Revit as an ImportInstance.
geometry: A single piece of geometry
Returns:

Revit.Elements.ImportInstance.Robustify(Autodesk.DesignScript.Geometry.Geometry@,Autodesk.DesignScript.Geometry.Vector@)
This method contains workarounds for increasing the robustness of input geometry
geometry:
translation:

Revit.Elements.ImportInstance.Robustify(Autodesk.DesignScript.Geometry.Geometry[]@,Autodesk.DesignScript.Geometry.Vector@)
This method contains workarounds for increasing the robustness of input geometry
geometries:
translation:

Revit.Elements.ImportInstance.Path
Gets file path of the sat file that represents the geometry of the specified ImportInstance Element